
rem ----------------------------------------------------------------------------
rem TRAC_PROJECT_ROOT : Tracプロジェクトディレクトリのルートディレクトリ
rem ----------------------------------------------------------------------------
set RM_PROJECT_ROOT=C:\ipftools\data\batch

rem ----------------------------------------------------------------------------
rem JAVA_HOME : Java ホームディレクトリ
rem ----------------------------------------------------------------------------
set JAVA_HOME=C:\ipftools\jre

rem ----------------------------------------------------------------------------
rem PENTAHO_HOME : Pentaho のホームディレクトリ
rem ----------------------------------------------------------------------------
set PENTAHO_HOME=C:\ipftools\pentaho\data-integration
set EXEC_KITCHEN=%PENTAHO_HOME%\kitchen.bat

