#!/bin/bash
export LANG=ja_JP.UTF-8

set_classpath()
{
    CLASSPATH=$CLASSPATH:$1
}

# ----------------------------------------------------------------------------
# RM_PROJECT_ROOT : redmineプロジェクトディレクトリのルートディレクトリ
# ----------------------------------------------------------------------------
RM_PROJECT_ROOT=/opt/ipftools/var/redmine

# ----------------------------------------------------------------------------
# JAVA_HOME : Java ホームディレクトリ
# ----------------------------------------------------------------------------
JAVA_HOME=/usr/java/jdk1.6.0_27

# ----------------------------------------------------------------------------
# PENTAHO_HOME : Pentaho のホームディレクトリ
# ----------------------------------------------------------------------------
PENTAHO_HOME=/opt/ipftools/pentaho/data-integration
EXEC_KITCHEN=$PENTAHO_HOME/kitchen.sh

