#!/bin/bash
export LANG=ja_JP.UTF-8

set_classpath()
{
    CLASSPATH=$CLASSPATH:$1
}

# ----------------------------------------------------------------------------
# RM_PROJECT_ROOT : redmineプロジェクトディレクトリのルートディレクトリ
# ----------------------------------------------------------------------------
RM_PROJECT_ROOT=@@IPFTOOLS_DATA_DIR@@/redmine

# ----------------------------------------------------------------------------
# JAVA_HOME : Java ホームディレクトリ
# ----------------------------------------------------------------------------
JAVA_HOME=@@IPFTOOLS_ROOT@@/jre

# ----------------------------------------------------------------------------
# PENTAHO_HOME : Pentaho のホームディレクトリ
# ----------------------------------------------------------------------------
PENTAHO_HOME=@@IPFTOOLS_ROOT@@/pentaho/data-integration
EXEC_KITCHEN=$PENTAHO_HOME/kitchen.sh
